# First code of python in jupyter notebook

In [2]:
print("hello world")

hello world

In [3]:
import pandas as pd

C:\Users\Sohail Dad\AppData\Local\Temp\ipykernel_1656\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

* Sereies(1 Dimensional)
* DataFrames( 2 Dimensional)

In [4]:
# print(pd)
Series_data = pd.Series([1,2,3,4,5]) #Sereies is a 1 dmension array
Series_data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
data_frame = pd.DataFrame({
    "Name":["A","B","C","D"],
    "Reg":[7701,7702,7703,7704],
})

In [7]:
data_frame

  Name   Reg
0    A  7701
1    B  7702
2    C  7703
3    D  7704

In [8]:
# how to change the columns names.
data_frame.columns = ["name","reg"]

In [9]:
data_frame

  name   reg
0    A  7701
1    B  7702
2    C  7703
3    D  7704

In [13]:
data_frame.loc[[0, 1]]

  name   reg
0    A  7701
1    B  7702

In [14]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index=['a','b','c'])
df

   calories  duration
a       420        50
b       380        40
c       390        45

## Read CSV(comma separat value)

In [17]:
df = pd.read_csv("CSV_Data/data.csv")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [18]:
df.head() #by default first 5 row

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [20]:
# df.to_string()   #this for use to string form

In [28]:
pd.options.display.max_rows = 60  #You can check your system's maximum rows with the pd.options.display.max_rows statement.

In [29]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]